#+BEGIN_COMMENT
.. title: Deep N-Grams: Creating the Model
.. slug: deep-n-grams-creating-the-model
.. date: 2021-01-05 16:48:01 UTC-08:00
.. tags: nlp,n-grams,rnn,gru
.. category: NLP
.. link: 
.. description: Creating a GRU model.
.. type: text

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3
#+PROPERTY: header-args :session ~/.local/share/jupyter/runtime/kernel-a24596d0-64a2-492f-addb-06954c445c65-ssh.json
#+BEGIN_SRC python :results none :exports none
%load_ext autoreload
%autoreload 2
#+END_SRC

** Will It Build?
#+begin_src python :results output :exports both
model = GRULM()
print(model)
#+end_src

#+RESULTS:
: Serial[
:   Serial[
:     ShiftRight(1)
:   ]
:   Embedding_256_512
:   GRU_512
:   GRU_512
:   Dense_256
:   LogSoftmax
: ]

** Check It Out

#+begin_src python :results output :exports both
from neurotic.nlp.deep_rnn import GRUModel

gru = GRUModel()
print(gru.model)
#+end_src   

#+RESULTS:
: Serial[
:   Serial[
:     ShiftRight(1)
:   ]
:   Embedding_256_512
:   GRU_512
:   GRU_512
:   Dense_256
:   LogSoftmax
: ]
